<a href="https://colab.research.google.com/github/Jeongyoon-Jang/SOLUX_summer_data/blob/master/1%EC%A3%BC%EC%B0%A8/%ED%8C%90%EB%8B%A4%EC%8A%A4_%EA%B8%B0%EC%B4%88_1(7%EC%9B%9424%EC%9D%BC).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
data_frame = pd.read_csv('friend_list.csv') #파일 불러오기

In [ ]:
data_frame #데이터 프레임 생성됨

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [ ]:
data_frame.tail(2) #뒤에 있는 2개 보기

    name  age      job
4  Brian   45  manager
5  Chris   25   intern

In [ ]:
type(data_frame.name)  #각각의 column은 series다. series로 구성된 것이 data frame.

pandas.core.series.Series

In [ ]:
list_tmp = [1,2,3]

In [ ]:
list_tmp

[1, 2, 3]

In [ ]:
s1 = pd.core.series.Series([1,2,3])

In [ ]:
s2 = pd.core.series.Series(['one','two','three'])

In [ ]:
pd.DataFrame(data=dict(num=s1, word=s2)) #Series로 DataFrame 만듦.

   num   word
0    1    one
1    2    two
2    3  three